Autodesk.Revit.DB.Architecture.TopographyLinkType.UpdateToposurfaceDataIfNecessary(System.Boolean)
Updates the external transform and toposurface data for topography link type if the original geometry is far away from the origin.
Remarks:
If the original geometry is farther away from the origin, it should be translated/transformed and the transform should be saved in the TopographyLinkType using this method. This ensures correct reporting of shared coordinates.
useOldExternalTrans:
Use the old transform
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.SetSurfacesData(System.Collections.Generic.IList{Autodesk.Revit.DB.Architecture.ToposurfaceData})
Sets the surfaces' data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.ReloadInternal(System.String,System.Boolean)
Reloads the link from curently-stored location.
path:
The path of the link file.
isFromAPI:
True if this method is called by API, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to reload the type.
Since:
2019.2

Autodesk.Revit.DB.Architecture.TopographyLinkType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.LinkLoadResult@)
Creates a new Topography link type.
aDoc:
The document in which to create the Topography Link.
linkFilePath:
The path of the link file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
aDoc is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Fail to access the link file.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019.2